def encode_to_unicode_codes(text):
    return ''.join(f'\\u{ord(char):04x}' for char in text)

def decode_from_unicode_codes(unicode_text):
    return ''.join(chr(int(code[2:], 16)) for code in unicode_text.split('\\u') if code)




def circled_text_converter(text: str) -> str:
    """Функция для преобразования символов в кружковые версии"""
    latin_map = {
        'a': '🅐', 'b': '🅑', 'c': '🅒', 'd': '🅓', 'e': '🅔',
        'f': '🅕', 'g': '🅖', 'h': '🅗', 'i': '🅘', 'j': '🅙',
        'k': '🅚', 'l': '🅛', 'm': '🅜', 'n': '🅝', 'o': '🅞',
        'p': '🅟', 'q': '🅠', 'r': '🅡', 's': '🅢', 't': '🅣',
        'u': '🅤', 'v': '🅥', 'w': '🅦', 'x': '🅧', 'y': '🅨',
        'z': '🅩',
        'A': '🅐', 'B': '🅑', 'C': '🅒', 'D': '🅓', 'E': '🅔',
        'F': '🅕', 'G': '🅖', 'H': '🅗', 'I': '🅘', 'J': '🅙',
        'K': '🅚', 'L': '🅛', 'M': '🅜', 'N': '🅝', 'O': '🅞',
        'P': '🅟', 'Q': '🅠', 'R': '🅡', 'S': '🅢', 'T': '🅣',
        'U': '🅤', 'V': '🅥', 'W': '🅦', 'X': '🅧', 'Y': '🅨',
        'Z': '🅩'
    }

    cyrillic_map = {
        'а': 'ⓐ', 'б': 'ⓑ', 'в': 'ⓒ', 'г': 'ⓖ', 'д': 'ⓓ',
        'е': 'ⓔ', 'ё': 'ⓔ', 'ж': 'ⓙ', 'з': 'ⓩ', 'и': 'ⓘ',
        'й': 'ⓘ', 'к': 'ⓚ', 'л': 'ⓛ', 'м': 'ⓜ', 'н': 'ⓝ',
        'о': 'ⓞ', 'п': 'ⓟ', 'р': 'ⓡ', 'с': 'ⓒ', 'т': 'ⓣ',
        'у': 'ⓤ', 'ф': 'ⓕ', 'х': 'ⓧ', 'ц': 'ⓒ', 'ч': 'ⓗ',
        'ш': 'ⓢ', 'щ': 'ⓢ', 'ъ': 'ⓠ', 'ы': 'ⓨ', 'ь': 'ⓑ',
        'э': 'ⓔ', 'ю': 'ⓤ', 'я': 'ⓐ',
        'А': 'Ⓐ', 'Б': 'Ⓑ', 'В': 'Ⓒ', 'Г': 'Ⓖ', 'Д': 'Ⓓ',
        'Е': 'Ⓔ', 'Ё': 'Ⓔ', 'Ж': 'Ⓙ', 'З': 'Ⓩ', 'И': 'Ⓘ',
        'Й': 'Ⓘ', 'К': 'Ⓚ', 'Л': 'Ⓛ', 'М': 'Ⓜ', 'Н': 'Ⓝ',
        'О': 'Ⓞ', 'П': 'Ⓟ', 'Р': 'Ⓡ', 'С': 'Ⓒ', 'Т': 'Ⓣ',
        'У': 'Ⓤ', 'Ф': 'Ⓕ', 'Х': 'Ⓧ', 'Ц': 'Ⓒ', 'Ч': 'Ⓗ',
        'Ш': 'Ⓢ', 'Щ': 'Ⓢ', 'Ъ': 'Ⓠ', 'Ы': 'Ⓨ', 'Ь': 'Ⓑ',
        'Э': 'Ⓔ', 'Ю': 'Ⓤ', 'Я': 'Ⓐ'
    }

    return ''.join([
        latin_map.get(c, cyrillic_map.get(c, c)) 
        for c in str(text)
    ])